[
    {
        "short":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages......",
        "img":"https://images.pexels.com/photos/5648417/pexels-photo-5648417.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "name":"Being FutuReady – Re-imagining Automotive Supply Chains in the Post-Covid World",
        "Author":" Mr. Rajesh Khatri, Vice President, Passenger Vehicle Business Unit, carCare",
        "message":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages, the automotive industry was left in the deep end for over a year and is still recovering from the shock. Global semiconductor shortages continue to haunt the automotive industry even today. What the pandemic has taught us, above all else, is the need to entirely rethink our strategic objectives when it comes to supply chains.Prior to the pandemic, most supply chains were focused on cost-optimization and throughput - the priority was to source parts at the lowest cost as quickly as possible. We weren't really thinking about flexibility or business continuity plans, or wondering, what if customer demands shift dramatically overnight? But post Covid-19, these questions have become central to supply chain management. As we venture into the future and plan for 2022 and beyond, it is time to reimagine our supply chain strategies to be FutuReady.",
        "name2":"Covering bases-Fundamentals in supply chain planning",
        "message2":"On a primary level, it is critical to ensure the supply chains we build function well according to some basic parameters. It is necessary, for instance, that we have complete visibility of our overall supply chain. We must view it across tiers, keeping in mind customer demands, technicalities of the procurement of raw materials, semi-finished goods, or components that go into our finished goods. The further we can go down and into the supply chain, the more effective we're going to be at planning our supply chain. Closely understanding manufacturing and warehouse processes, logistics, shipping, and third-party logistics can also present optimization opportunities. Further, a solid understanding of the cost structure at a unit level is very important to prevent sudden supplier breakdowns and can help organizations keep costs under check while maintaining steady margins, even allowing them to leverage supplier clusters to minimize cost.Besides this, it is also necessary to diversify the supplier base. It is important that you ensure you have a plan B, a plan C, and backup vendors in case one vendor cannot meet your needs. This may reduce purchasing power with any one given supplier, but that might be a worthy trade-off while gaining flexibility, dependency, and reliability within your supply chain. Your existing suppliers must also be reliable. When determining supplier reliability, make sure you consider some questions like: Is it likely our suppliers will have to shut down or not run-in full capacity during a tumultuous time? Are they proactively collaborating with their supply chain on changes in demand, capacity requirements and other critical factors? Are they adequately staffed?",
        "name3":"Ensuring business continuity with supply chain optimization",
        "message3":"Once we have addressed our basics, we can optimize the supply chain in several ways. Consider for instance, ways in which you can simplify products and standardize parts. Overly complex products involving a large variety of materials makes the supply chain complex and prone to disruptions. Instead, procuring standard catalogue rather than product-specific parts can help maintain a lean supplier base - case in point: an application specific integrated circuit in the semiconductor industry. Another way to have a minimum disruption supply chain is optimizing logistics. Procuring parts locally instead of obtaining them across the globe can help mitigate geo-political risks.Demand and supply planning can also be critical in enhancing efficiency in the supply chain. Companies that can align demand with supply gain an edge when compared with the rest. Since this delicate balance starts with the proactive management of demand, demand planning and forecasting acquires critical priority. Aligning with your customers' needs improves the customer experience, accelerates cash flow and brings profit to the bottom line. To understand demand fluctuations, keeping an ear to the ground and getting in touch with stakeholders (customers, sales staff and customer service representatives) can be fruitful. On the supply front, it is important to ensure capacity readiness, and retain agility and flexibility while delivering consistently as per demand.On a broader level, it is also important that we learn to manage risks proactively, rather than reactively. While it is certainly impossible to predict black swan events like the pandemic, one can remain acutely aware of one's own vulnerabilities, especially vis-à-vis pressure areas in the supply chain. Instituting a comprehensive business continuity plan can prove invaluable in this regard, giving companies a systematic framework to anticipate risks and work towards mitigation. The moment risk is sensed from any sector, this BCP must be set in motion. This can play a crucial role in allowing the OEM to insure itself against long-term damage."
    },
    {
        "short":"Road accidents account for one of the leading causes of death in the world[1] claiming nearly 1.3 million lives each year. India itself accounts for 11% of global death in road accidents[2]. Hence road safety and its awareness become a critical issue for the prevention of accidents.......",
        "img":"https://images.pexels.com/photos/937481/pexels-photo-937481.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "name":"Demystifying Vehicular Safety: The Fundamentals of Engineering a Safe Vehicle",
        "Author":" By S J R Kutty, Chief Sustainability Officer and Head-Vehicle Attributes & Technical Services, carCare",
        "message":"Our roads can be made safer by deploying updated regulations as well as innovative interventions by OEMs/automobile companies who constantly work on enhancing the safety of their products by making sustainable investments in accident research. Continuous research is imperative to come up with technologies and design of safer products or safety features in products. Tata Motors has been one of the early movers in the automobile industry with respect to making investments for establishing state-of-the-art digital and physical product development processes manned by the best minds in terms of road safety in the country. The endeavour to build a safe vehicle is a complex and meticulous process that requires constant coordination between multiple parties. Here we demystify some of the crucial steps for making safer vehicles for tomorrow.Our roads can be made safer by deploying updated regulations as well as innovative interventions by OEMs/automobile companies who constantly work on enhancing the safety of their products by making sustainable investments in accident research. Continuous research is imperative to come up with technologies and design of safer products or safety features in products. Tata Motors has been one of the early movers in the automobile industry with respect to making investments for establishing state-of-the-art digital and physical product development processes manned by the best minds in terms of road safety in the country. The endeavour to build a safe vehicle is a complex and meticulous process that requires constant coordination between multiple parties. Here we demystify some of the crucial steps for making safer vehicles for tomorrow.",
        "name2":"Covering grounds: The various aspects of vehicular safety",
        "message2":"Contrary to common perception, vehicular safety is much more than just ‘airbags’. It is all-encompassing and has numerous aspects covering the vehicle, the environment and the people who drive the vehicle in three stages: namely, pre-, during- and post- an accident. This also means that safety is not only passive but also active. Passive safety covers devices that operate when an accident occurs. Seat belts, front, side and curtain airbags, head restraints, ISOFIX mounts, etc. are some examples of such devices. In contrast, active safety encompasses all other features that promote safe driving, such as the presence of brake assists, tyre pressure monitoring sensors, parking sensors, etc. In fact, several advanced driver-assist features embed safety holistically and aid in preventing accidents and post-crash situations as well. The integration between active and passive safety is crucial in building a safer vehicle.",
        "name3":"Researching accidents effectively to democratize minimum safety",
        "message3":"Once a vehicle is on the road there are innumerable real-world safety challenges every driver constantly encounters, from frontal or offset crashes, to side hits, rear-end collisions, roll-overs, and instability. The complexity of mass and human anatomy and driving on improper roads at varying and sometimes breakneck speeds, all pose fundamental challenges of appropriate product configuration for maximising protection in extraordinary circumstances when needed by either the vehicle occupant or the pedestrian.Taking account of these use-cases in part, as mentioned earlier, is important to ensure safety. However, providing for each of them will make automobiles so unaffordable that a safety-conscious prospective buyer will have to settle for affordable mobility solutions which are unfortunately unsafe. Inappropriate configuration and over-specification of products can therefore become a case of the “great” becoming the enemy of the “good”. Thus, it is important to research accidents and cluster them wisely to carefully configure learnings in products. Automakers must provide safe options for customers in non-luxury products too, while striving to democratise safety for all."
    },
    {
        "short":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages......",
        "img":"https://images.pexels.com/photos/5648417/pexels-photo-5648417.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "name":"Decoding India’s SUV ‘Fever’: Why SUVs are Defining the Mobility of Today",
        "Author":" Author: Mr Mohan Savarkar, Vice President, Product Line, CarCare Motors Passenger Vehicles Ltd",
        "message":"Evolving needs, changing social priorities and economic circumstances have consistently determined the nature of mobility across the world. Passenger vehicle styles have undergone consistent transformation over the years in tandem with varying geographical requirements and customer needs. In the past decade, sports utility vehicles (SUVs) have increasingly made their presence felt within the market, seeing marked increase in adoption. Between 2010 to 2021, the global population of SUVs has increased from fifty million to a whopping 320 million.India too, has seen considerable increase in the adoption of SUVs. In the last three years alone, the SUV share in India increased from about 23% in FY19 to about 41 % in FY22. So, why are SUVs becoming increasingly popular in India, and what are some key defining features that determine the SUV preference today?",
        "name2":"Changing consumer perception and the SUV demand surge  ",
        "message2":"For starters, the way SUVs are perceived has shifted considerably. Utility vehicles were initially conceived as hard-wearing, utilitarian workhorses with an emphasis on enclosed utility. They were purpose-built, high on capability and meant for off-road usage (for use in challenging terrain, like sand, mud, rocks, in the absence of paved road). But today, SUVs are increasingly becoming lifestyle-defined, high on practicality, and meant for urban usage with on-road capability (the ability of a vehicle to drive at high speeds on highways and in ghats with good stability).Within India particularly, both practical and aspirational/emotional considerations are driving demand for SUVs within customers. SUVs offer a significant advantage on Indian roads, providing optimum navigation with high ground clearance on broken tarmac and speed breakers. On flooded roads during the rainy season, their increased ride height and command seating position allows for more confident driving, and Indian customers generally feel safer in an SUV in typical Indian driving conditions. Besides this, SUVs also come with a strong aspirational value, with the promise of fun and adventure fuelled by their go-anywhere capability.",
        "name3":"Changing vectors in SUVs today: Comfort and design are key",
        "message3":"Utility vehicles of the past essentially just came with seats on a chassis, offering comfort which was just a little better than riding horseback. Compare that to SUVs today, which offer unparalleled ride and seating comfort. Modern SUVs are comfortable to drive and ride in, ergonomically designed to provide enhanced ride and seating comfort. They also include advanced features for temperature control.Further, SUVs before typically connoted big, large, and bulky. This was in tandem with their view as mostly utility-based vehicles. However, with changing customer demands, SUVs have evolved considerably. SUV design elements on small but capable products have largely democratised the SUV lifestyle. Consequently, SUVs today come in all sizes. Just as in the case of cars, they are categorized as sub-compact, compact, and full-size. Their design aptly symbolizes the stylized, sturdy and confident, and irrespective of the size they come in, they deliver uncompromisingly on expected performance."
    },
    {
        "short":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages......",
        "img":"https://images.pexels.com/photos/999267/pexels-photo-999267.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "name":"Being FutuReady – Re-imagining Automotive Supply Chains in the Post-Covid World",
        "Author":" Mr. Rajesh Khatri, Vice President, Passenger Vehicle Business Unit, carCare",
        "message":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages, the automotive industry was left in the deep end for over a year and is still recovering from the shock. Global semiconductor shortages continue to haunt the automotive industry even today. What the pandemic has taught us, above all else, is the need to entirely rethink our strategic objectives when it comes to supply chains.Prior to the pandemic, most supply chains were focused on cost-optimization and throughput - the priority was to source parts at the lowest cost as quickly as possible. We weren't really thinking about flexibility or business continuity plans, or wondering, what if customer demands shift dramatically overnight? But post Covid-19, these questions have become central to supply chain management. As we venture into the future and plan for 2022 and beyond, it is time to reimagine our supply chain strategies to be FutuReady.",
        "name2":"Covering bases-Fundamentals in supply chain planning",
        "message2":"On a primary level, it is critical to ensure the supply chains we build function well according to some basic parameters. It is necessary, for instance, that we have complete visibility of our overall supply chain. We must view it across tiers, keeping in mind customer demands, technicalities of the procurement of raw materials, semi-finished goods, or components that go into our finished goods. The further we can go down and into the supply chain, the more effective we're going to be at planning our supply chain. Closely understanding manufacturing and warehouse processes, logistics, shipping, and third-party logistics can also present optimization opportunities. Further, a solid understanding of the cost structure at a unit level is very important to prevent sudden supplier breakdowns and can help organizations keep costs under check while maintaining steady margins, even allowing them to leverage supplier clusters to minimize cost.Besides this, it is also necessary to diversify the supplier base. It is important that you ensure you have a plan B, a plan C, and backup vendors in case one vendor cannot meet your needs. This may reduce purchasing power with any one given supplier, but that might be a worthy trade-off while gaining flexibility, dependency, and reliability within your supply chain. Your existing suppliers must also be reliable. When determining supplier reliability, make sure you consider some questions like: Is it likely our suppliers will have to shut down or not run-in full capacity during a tumultuous time? Are they proactively collaborating with their supply chain on changes in demand, capacity requirements and other critical factors? Are they adequately staffed?",
        "name3":"Ensuring business continuity with supply chain optimization",
        "message3":"Once we have addressed our basics, we can optimize the supply chain in several ways. Consider for instance, ways in which you can simplify products and standardize parts. Overly complex products involving a large variety of materials makes the supply chain complex and prone to disruptions. Instead, procuring standard catalogue rather than product-specific parts can help maintain a lean supplier base - case in point: an application specific integrated circuit in the semiconductor industry. Another way to have a minimum disruption supply chain is optimizing logistics. Procuring parts locally instead of obtaining them across the globe can help mitigate geo-political risks.Demand and supply planning can also be critical in enhancing efficiency in the supply chain. Companies that can align demand with supply gain an edge when compared with the rest. Since this delicate balance starts with the proactive management of demand, demand planning and forecasting acquires critical priority. Aligning with your customers' needs improves the customer experience, accelerates cash flow and brings profit to the bottom line. To understand demand fluctuations, keeping an ear to the ground and getting in touch with stakeholders (customers, sales staff and customer service representatives) can be fruitful. On the supply front, it is important to ensure capacity readiness, and retain agility and flexibility while delivering consistently as per demand.On a broader level, it is also important that we learn to manage risks proactively, rather than reactively. While it is certainly impossible to predict black swan events like the pandemic, one can remain acutely aware of one's own vulnerabilities, especially vis-à-vis pressure areas in the supply chain. Instituting a comprehensive business continuity plan can prove invaluable in this regard, giving companies a systematic framework to anticipate risks and work towards mitigation. The moment risk is sensed from any sector, this BCP must be set in motion. This can play a crucial role in allowing the OEM to insure itself against long-term damage."
    },
    {
        "short":"Bringing the benefits of comfort, convenience, and personalization at our fingertips, the digital revolution has changed the way we experience life. Digital technology has allowed consumers to access products and services in ways that were unimaginable before, with the rise of information technology models such as SMAC (social, mobile, analytics and cloud). The potential provided by artificial intelligence (AI) and advanced data analytics has allowed businesses to provide an enriching and interactive experience to consumers. Against this backdrop, the automobile sector has also tried to embrace the shift to digital......",
        "img":"https://images.pexels.com/photos/327540/pexels-photo-327540.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "name":"Evolutionary Platforms, Revolutionary Outcomes: Digital Transformation in the Automotive Industry",
        "Author":" Author: Mr. Gopinath Jayaraj, Chief Information Officer,  carCare",
        "message":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages, the automotive industry was left in the deep end for over a year and is still recovering from the shock. Global semiconductor shortages continue to haunt the automotive industry even today. What the pandemic has taught us, above all else, is the need to entirely rethink our strategic objectives when it comes to supply chains.Prior to the pandemic, most supply chains were focused on cost-optimization and throughput - the priority was to source parts at the lowest cost as quickly as possible. We weren't really thinking about flexibility or business continuity plans, or wondering, what if customer demands shift dramatically overnight? But post Covid-19, these questions have become central to supply chain management. As we venture into the future and plan for 2022 and beyond, it is time to reimagine our supply chain strategies to be FutuReady.",
        "name2":"Covering bases-Fundamentals in supply chain planning",
        "message2":"On a primary level, it is critical to ensure the supply chains we build function well according to some basic parameters. It is necessary, for instance, that we have complete visibility of our overall supply chain. We must view it across tiers, keeping in mind customer demands, technicalities of the procurement of raw materials, semi-finished goods, or components that go into our finished goods. The further we can go down and into the supply chain, the more effective we're going to be at planning our supply chain. Closely understanding manufacturing and warehouse processes, logistics, shipping, and third-party logistics can also present optimization opportunities. Further, a solid understanding of the cost structure at a unit level is very important to prevent sudden supplier breakdowns and can help organizations keep costs under check while maintaining steady margins, even allowing them to leverage supplier clusters to minimize cost.Besides this, it is also necessary to diversify the supplier base. It is important that you ensure you have a plan B, a plan C, and backup vendors in case one vendor cannot meet your needs. This may reduce purchasing power with any one given supplier, but that might be a worthy trade-off while gaining flexibility, dependency, and reliability within your supply chain. Your existing suppliers must also be reliable. When determining supplier reliability, make sure you consider some questions like: Is it likely our suppliers will have to shut down or not run-in full capacity during a tumultuous time? Are they proactively collaborating with their supply chain on changes in demand, capacity requirements and other critical factors? Are they adequately staffed?",
        "name3":"Ensuring business continuity with supply chain optimization",
        "message3":"Once we have addressed our basics, we can optimize the supply chain in several ways. Consider for instance, ways in which you can simplify products and standardize parts. Overly complex products involving a large variety of materials makes the supply chain complex and prone to disruptions. Instead, procuring standard catalogue rather than product-specific parts can help maintain a lean supplier base - case in point: an application specific integrated circuit in the semiconductor industry. Another way to have a minimum disruption supply chain is optimizing logistics. Procuring parts locally instead of obtaining them across the globe can help mitigate geo-political risks.Demand and supply planning can also be critical in enhancing efficiency in the supply chain. Companies that can align demand with supply gain an edge when compared with the rest. Since this delicate balance starts with the proactive management of demand, demand planning and forecasting acquires critical priority. Aligning with your customers' needs improves the customer experience, accelerates cash flow and brings profit to the bottom line. To understand demand fluctuations, keeping an ear to the ground and getting in touch with stakeholders (customers, sales staff and customer service representatives) can be fruitful. On the supply front, it is important to ensure capacity readiness, and retain agility and flexibility while delivering consistently as per demand.On a broader level, it is also important that we learn to manage risks proactively, rather than reactively. While it is certainly impossible to predict black swan events like the pandemic, one can remain acutely aware of one's own vulnerabilities, especially vis-à-vis pressure areas in the supply chain. Instituting a comprehensive business continuity plan can prove invaluable in this regard, giving companies a systematic framework to anticipate risks and work towards mitigation. The moment risk is sensed from any sector, this BCP must be set in motion. This can play a crucial role in allowing the OEM to insure itself against long-term damage."
    },
    {
        "short":"With global organizations decisively highlighting the urgent need to migrate to cleaner forms of mobility, leading nations have enacted focused efforts to accelerate the electric vehicle (EV) revolution in the automobile industry. Growing environmental consciousness and an increased awareness about the benefits of EVs has stirred consumer interest and the demand for EVs is expected to rise substantially in the next decade.......",
        "img":"https://images.pexels.com/photos/4175026/pexels-photo-4175026.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "name":"Maximizing Performance, Minimizing Wastage: Energy Management in EVs and Why it is Crucial",
        "Author":" Author - Mr. Anand Kulkarni, Vice President, Product Line & Operations, Tata Passenger Electric Mobility Ltd. carCare",
        "message":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages, the automotive industry was left in the deep end for over a year and is still recovering from the shock. Global semiconductor shortages continue to haunt the automotive industry even today. What the pandemic has taught us, above all else, is the need to entirely rethink our strategic objectives when it comes to supply chains.Prior to the pandemic, most supply chains were focused on cost-optimization and throughput - the priority was to source parts at the lowest cost as quickly as possible. We weren't really thinking about flexibility or business continuity plans, or wondering, what if customer demands shift dramatically overnight? But post Covid-19, these questions have become central to supply chain management. As we venture into the future and plan for 2022 and beyond, it is time to reimagine our supply chain strategies to be FutuReady.",
        "name2":"Covering bases-Fundamentals in supply chain planning",
        "message2":"On a primary level, it is critical to ensure the supply chains we build function well according to some basic parameters. It is necessary, for instance, that we have complete visibility of our overall supply chain. We must view it across tiers, keeping in mind customer demands, technicalities of the procurement of raw materials, semi-finished goods, or components that go into our finished goods. The further we can go down and into the supply chain, the more effective we're going to be at planning our supply chain. Closely understanding manufacturing and warehouse processes, logistics, shipping, and third-party logistics can also present optimization opportunities. Further, a solid understanding of the cost structure at a unit level is very important to prevent sudden supplier breakdowns and can help organizations keep costs under check while maintaining steady margins, even allowing them to leverage supplier clusters to minimize cost.Besides this, it is also necessary to diversify the supplier base. It is important that you ensure you have a plan B, a plan C, and backup vendors in case one vendor cannot meet your needs. This may reduce purchasing power with any one given supplier, but that might be a worthy trade-off while gaining flexibility, dependency, and reliability within your supply chain. Your existing suppliers must also be reliable. When determining supplier reliability, make sure you consider some questions like: Is it likely our suppliers will have to shut down or not run-in full capacity during a tumultuous time? Are they proactively collaborating with their supply chain on changes in demand, capacity requirements and other critical factors? Are they adequately staffed?",
        "name3":"Ensuring business continuity with supply chain optimization",
        "message3":"Once we have addressed our basics, we can optimize the supply chain in several ways. Consider for instance, ways in which you can simplify products and standardize parts. Overly complex products involving a large variety of materials makes the supply chain complex and prone to disruptions. Instead, procuring standard catalogue rather than product-specific parts can help maintain a lean supplier base - case in point: an application specific integrated circuit in the semiconductor industry. Another way to have a minimum disruption supply chain is optimizing logistics. Procuring parts locally instead of obtaining them across the globe can help mitigate geo-political risks.Demand and supply planning can also be critical in enhancing efficiency in the supply chain. Companies that can align demand with supply gain an edge when compared with the rest. Since this delicate balance starts with the proactive management of demand, demand planning and forecasting acquires critical priority. Aligning with your customers' needs improves the customer experience, accelerates cash flow and brings profit to the bottom line. To understand demand fluctuations, keeping an ear to the ground and getting in touch with stakeholders (customers, sales staff and customer service representatives) can be fruitful. On the supply front, it is important to ensure capacity readiness, and retain agility and flexibility while delivering consistently as per demand.On a broader level, it is also important that we learn to manage risks proactively, rather than reactively. While it is certainly impossible to predict black swan events like the pandemic, one can remain acutely aware of one's own vulnerabilities, especially vis-à-vis pressure areas in the supply chain. Instituting a comprehensive business continuity plan can prove invaluable in this regard, giving companies a systematic framework to anticipate risks and work towards mitigation. The moment risk is sensed from any sector, this BCP must be set in motion. This can play a crucial role in allowing the OEM to insure itself against long-term damage."
    },
    {
        "short":"You go to a premium branded clothes store and pick a nice T-shirt for yourself. You receive compliments wearing it and so it becomes your new favourite. You wear it at a few social gatherings and a few months later, it seems to lose its sheen, you then decide to wear it......",
        "img":"https://images.pexels.com/photos/3307862/pexels-photo-3307862.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "name":"Junkyard diaries",
        "Author":"ndia’s scrappage policy is about to bring a sea of change in the way we look at the vehicle lifecycle. We dive deep to understand what’s in it for you and the ecosystem, at large.",
        "message":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages, the automotive industry was left in the deep end for over a year and is still recovering from the shock. Global semiconductor shortages continue to haunt the automotive industry even today. What the pandemic has taught us, above all else, is the need to entirely rethink our strategic objectives when it comes to supply chains.Prior to the pandemic, most supply chains were focused on cost-optimization and throughput - the priority was to source parts at the lowest cost as quickly as possible. We weren't really thinking about flexibility or business continuity plans, or wondering, what if customer demands shift dramatically overnight? But post Covid-19, these questions have become central to supply chain management. As we venture into the future and plan for 2022 and beyond, it is time to reimagine our supply chain strategies to be FutuReady.",
        "name2":"Covering bases-Fundamentals in supply chain planning",
        "message2":"On a primary level, it is critical to ensure the supply chains we build function well according to some basic parameters. It is necessary, for instance, that we have complete visibility of our overall supply chain. We must view it across tiers, keeping in mind customer demands, technicalities of the procurement of raw materials, semi-finished goods, or components that go into our finished goods. The further we can go down and into the supply chain, the more effective we're going to be at planning our supply chain. Closely understanding manufacturing and warehouse processes, logistics, shipping, and third-party logistics can also present optimization opportunities. Further, a solid understanding of the cost structure at a unit level is very important to prevent sudden supplier breakdowns and can help organizations keep costs under check while maintaining steady margins, even allowing them to leverage supplier clusters to minimize cost.Besides this, it is also necessary to diversify the supplier base. It is important that you ensure you have a plan B, a plan C, and backup vendors in case one vendor cannot meet your needs. This may reduce purchasing power with any one given supplier, but that might be a worthy trade-off while gaining flexibility, dependency, and reliability within your supply chain. Your existing suppliers must also be reliable. When determining supplier reliability, make sure you consider some questions like: Is it likely our suppliers will have to shut down or not run-in full capacity during a tumultuous time? Are they proactively collaborating with their supply chain on changes in demand, capacity requirements and other critical factors? Are they adequately staffed?",
        "name3":"Ensuring business continuity with supply chain optimization",
        "message3":"Once we have addressed our basics, we can optimize the supply chain in several ways. Consider for instance, ways in which you can simplify products and standardize parts. Overly complex products involving a large variety of materials makes the supply chain complex and prone to disruptions. Instead, procuring standard catalogue rather than product-specific parts can help maintain a lean supplier base - case in point: an application specific integrated circuit in the semiconductor industry. Another way to have a minimum disruption supply chain is optimizing logistics. Procuring parts locally instead of obtaining them across the globe can help mitigate geo-political risks.Demand and supply planning can also be critical in enhancing efficiency in the supply chain. Companies that can align demand with supply gain an edge when compared with the rest. Since this delicate balance starts with the proactive management of demand, demand planning and forecasting acquires critical priority. Aligning with your customers' needs improves the customer experience, accelerates cash flow and brings profit to the bottom line. To understand demand fluctuations, keeping an ear to the ground and getting in touch with stakeholders (customers, sales staff and customer service representatives) can be fruitful. On the supply front, it is important to ensure capacity readiness, and retain agility and flexibility while delivering consistently as per demand.On a broader level, it is also important that we learn to manage risks proactively, rather than reactively. While it is certainly impossible to predict black swan events like the pandemic, one can remain acutely aware of one's own vulnerabilities, especially vis-à-vis pressure areas in the supply chain. Instituting a comprehensive business continuity plan can prove invaluable in this regard, giving companies a systematic framework to anticipate risks and work towards mitigation. The moment risk is sensed from any sector, this BCP must be set in motion. This can play a crucial role in allowing the OEM to insure itself against long-term damage."
    },
    {
        "short":"'Team work is dream work', they say. It won't be more apt in a case where engineers and designers sitting in offices separated by 5,500km of land between them, would be working together to redefine cargo transportation needs to one of the fastest growing nation in the world. Ladies and gentlemen, welcome theCen......",
        "img":"https://images.pexels.com/photos/5648417/pexels-photo-5648417.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "name":"From India, with love",
        "Author":"Tata Motors and Tata Daewoo Commercial Vehicles locked horns with South Korea's Numero Uno in the CV space and gave birth to a challenger that will hold a special place in Korea's motoring history carCare",
        "message":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages, the automotive industry was left in the deep end for over a year and is still recovering from the shock. Global semiconductor shortages continue to haunt the automotive industry even today. What the pandemic has taught us, above all else, is the need to entirely rethink our strategic objectives when it comes to supply chains.Prior to the pandemic, most supply chains were focused on cost-optimization and throughput - the priority was to source parts at the lowest cost as quickly as possible. We weren't really thinking about flexibility or business continuity plans, or wondering, what if customer demands shift dramatically overnight? But post Covid-19, these questions have become central to supply chain management. As we venture into the future and plan for 2022 and beyond, it is time to reimagine our supply chain strategies to be FutuReady.",
        "name2":"Covering bases-Fundamentals in supply chain planning",
        "message2":"On a primary level, it is critical to ensure the supply chains we build function well according to some basic parameters. It is necessary, for instance, that we have complete visibility of our overall supply chain. We must view it across tiers, keeping in mind customer demands, technicalities of the procurement of raw materials, semi-finished goods, or components that go into our finished goods. The further we can go down and into the supply chain, the more effective we're going to be at planning our supply chain. Closely understanding manufacturing and warehouse processes, logistics, shipping, and third-party logistics can also present optimization opportunities. Further, a solid understanding of the cost structure at a unit level is very important to prevent sudden supplier breakdowns and can help organizations keep costs under check while maintaining steady margins, even allowing them to leverage supplier clusters to minimize cost.Besides this, it is also necessary to diversify the supplier base. It is important that you ensure you have a plan B, a plan C, and backup vendors in case one vendor cannot meet your needs. This may reduce purchasing power with any one given supplier, but that might be a worthy trade-off while gaining flexibility, dependency, and reliability within your supply chain. Your existing suppliers must also be reliable. When determining supplier reliability, make sure you consider some questions like: Is it likely our suppliers will have to shut down or not run-in full capacity during a tumultuous time? Are they proactively collaborating with their supply chain on changes in demand, capacity requirements and other critical factors? Are they adequately staffed?",
        "name3":"Ensuring business continuity with supply chain optimization",
        "message3":"Once we have addressed our basics, we can optimize the supply chain in several ways. Consider for instance, ways in which you can simplify products and standardize parts. Overly complex products involving a large variety of materials makes the supply chain complex and prone to disruptions. Instead, procuring standard catalogue rather than product-specific parts can help maintain a lean supplier base - case in point: an application specific integrated circuit in the semiconductor industry. Another way to have a minimum disruption supply chain is optimizing logistics. Procuring parts locally instead of obtaining them across the globe can help mitigate geo-political risks.Demand and supply planning can also be critical in enhancing efficiency in the supply chain. Companies that can align demand with supply gain an edge when compared with the rest. Since this delicate balance starts with the proactive management of demand, demand planning and forecasting acquires critical priority. Aligning with your customers' needs improves the customer experience, accelerates cash flow and brings profit to the bottom line. To understand demand fluctuations, keeping an ear to the ground and getting in touch with stakeholders (customers, sales staff and customer service representatives) can be fruitful. On the supply front, it is important to ensure capacity readiness, and retain agility and flexibility while delivering consistently as per demand.On a broader level, it is also important that we learn to manage risks proactively, rather than reactively. While it is certainly impossible to predict black swan events like the pandemic, one can remain acutely aware of one's own vulnerabilities, especially vis-à-vis pressure areas in the supply chain. Instituting a comprehensive business continuity plan can prove invaluable in this regard, giving companies a systematic framework to anticipate risks and work towards mitigation. The moment risk is sensed from any sector, this BCP must be set in motion. This can play a crucial role in allowing the OEM to insure itself against long-term damage."
    },
    {
        "short":"My son is 24 years old and in his final year of a MBA course in Mumbai. In March 2020, just before the lockdown was announced he was doing a community service project in a remote village in Mahrashtra as a part of his curriculum. Sensing the situation he booked a train ticket to his hometown in Lucknow to reach home just 6 hours before the lockdown began. But on the way he made sure that his two other friends made it safely home......",
        "img":"https://images.pexels.com/photos/936043/pexels-photo-936043.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "name":"Vishal Agrawal, Lucknow",
        "Author":" What I have learned from my Child",
        "message":"The impact of the Covid-19 pandemic on supply chains world-over has been profoundly disruptive, to say the least. Reeling under sudden lockdowns, fluctuations in demand and supply, logistics disruptions and shortages, the automotive industry was left in the deep end for over a year and is still recovering from the shock. Global semiconductor shortages continue to haunt the automotive industry even today. What the pandemic has taught us, above all else, is the need to entirely rethink our strategic objectives when it comes to supply chains.Prior to the pandemic, most supply chains were focused on cost-optimization and throughput - the priority was to source parts at the lowest cost as quickly as possible. We weren't really thinking about flexibility or business continuity plans, or wondering, what if customer demands shift dramatically overnight? But post Covid-19, these questions have become central to supply chain management. As we venture into the future and plan for 2022 and beyond, it is time to reimagine our supply chain strategies to be FutuReady.",
        "name2":"Covering bases-Fundamentals in supply chain planning",
        "message2":"On a primary level, it is critical to ensure the supply chains we build function well according to some basic parameters. It is necessary, for instance, that we have complete visibility of our overall supply chain. We must view it across tiers, keeping in mind customer demands, technicalities of the procurement of raw materials, semi-finished goods, or components that go into our finished goods. The further we can go down and into the supply chain, the more effective we're going to be at planning our supply chain. Closely understanding manufacturing and warehouse processes, logistics, shipping, and third-party logistics can also present optimization opportunities. Further, a solid understanding of the cost structure at a unit level is very important to prevent sudden supplier breakdowns and can help organizations keep costs under check while maintaining steady margins, even allowing them to leverage supplier clusters to minimize cost.Besides this, it is also necessary to diversify the supplier base. It is important that you ensure you have a plan B, a plan C, and backup vendors in case one vendor cannot meet your needs. This may reduce purchasing power with any one given supplier, but that might be a worthy trade-off while gaining flexibility, dependency, and reliability within your supply chain. Your existing suppliers must also be reliable. When determining supplier reliability, make sure you consider some questions like: Is it likely our suppliers will have to shut down or not run-in full capacity during a tumultuous time? Are they proactively collaborating with their supply chain on changes in demand, capacity requirements and other critical factors? Are they adequately staffed?",
        "name3":"Ensuring business continuity with supply chain optimization",
        "message3":"Once we have addressed our basics, we can optimize the supply chain in several ways. Consider for instance, ways in which you can simplify products and standardize parts. Overly complex products involving a large variety of materials makes the supply chain complex and prone to disruptions. Instead, procuring standard catalogue rather than product-specific parts can help maintain a lean supplier base - case in point: an application specific integrated circuit in the semiconductor industry. Another way to have a minimum disruption supply chain is optimizing logistics. Procuring parts locally instead of obtaining them across the globe can help mitigate geo-political risks.Demand and supply planning can also be critical in enhancing efficiency in the supply chain. Companies that can align demand with supply gain an edge when compared with the rest. Since this delicate balance starts with the proactive management of demand, demand planning and forecasting acquires critical priority. Aligning with your customers' needs improves the customer experience, accelerates cash flow and brings profit to the bottom line. To understand demand fluctuations, keeping an ear to the ground and getting in touch with stakeholders (customers, sales staff and customer service representatives) can be fruitful. On the supply front, it is important to ensure capacity readiness, and retain agility and flexibility while delivering consistently as per demand.On a broader level, it is also important that we learn to manage risks proactively, rather than reactively. While it is certainly impossible to predict black swan events like the pandemic, one can remain acutely aware of one's own vulnerabilities, especially vis-à-vis pressure areas in the supply chain. Instituting a comprehensive business continuity plan can prove invaluable in this regard, giving companies a systematic framework to anticipate risks and work towards mitigation. The moment risk is sensed from any sector, this BCP must be set in motion. This can play a crucial role in allowing the OEM to insure itself against long-term damage."
    }
]